tutorials/heatTransfer/boussinesqBuoyantFoam/heatedCavity/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

writeFormat     raw;

sampleSets
(
    uniform
    {
        name            cutLine;
        axis            distance;
        start           (0 0.05 0.0005);
        end             (0.1 0.05 0.0005);
        nPoints         100;
    }
);

fields
(
    p
);

// ************************************************************************* //
